#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

data.github_user.benoit: Reading...
data.github_user.caitlin: Reading...
data.github_user.florian: Reading...
data.github_user.chris: Reading...
module.repo-sbx-actions.github_repository.repository: Refreshing state... [id=sbx-actions]
module.team_sbx.github_team.team[0]: Refreshing state... [id=7033781]
module.repo1.github_repository.repository: Refreshing state... [id=test-repo-1]
module.repository_project.github_repository.repository: Refreshing state... [id=project]
module.team_project.github_team.team[0]: Refreshing state... [id=6696757]
module.repo2.github_repository.repository: Refreshing state... [id=test-repo-2]
data.github_user.andreas: Reading...
data.github_user.meejah: Reading...
data.github_user.jean_paul: Reading...
module.team_internal.github_team.team[0]: Refreshing state... [id=6696813]
module.team_test.github_team.team[0]: Refreshing state... [id=6696811]
module.repo-sbx-actions.github_actions_secret.repository_secret["CID_PRIVATE_KEY"]: Refreshing state... [id=sbx-actions:CID_PRIVATE_KEY]
data.github_user.caitlin: Read complete after 1s [id=63412287]
module.repo-sbx-actions.github_team_repository.team_repository_by_slug["sbx"]: Refreshing state... [id=7033781:sbx-actions]
module.repository_project.github_team_repository.team_repository_by_slug["project"]: Refreshing state... [id=6696757:project]
module.team_foo.github_team.team[0]: Refreshing state... [id=6696818]
module.repo2.github_team_repository.team_repository_by_slug["test"]: Refreshing state... [id=6696811:test-repo-2]
data.github_user.benoit: Read complete after 2s [id=7703888]
module.repo-sbx-actions.github_repository_collaborator.collaborator["btlogy"]: Refreshing state... [id=sbx-actions:btlogy]
data.github_user.florian: Read complete after 2s [id=454605]
module.repo1.github_repository_collaborator.collaborator["hacklschorsch"]: Refreshing state... [id=test-repo-1:hacklschorsch]
data.github_user.chris: Read complete after 2s [id=882430]
module.repo1.github_team_repository.team_repository_by_slug["foo"]: Refreshing state... [id=6696818:test-repo-1]
data.github_user.andreas: Read complete after 2s [id=563314]
module.team_sbx.github_team_membership.team_membership["btlogy"]: Refreshing state... [id=7033781:btlogy]
module.team_sbx.github_team_membership.team_membership["wuan"]: Refreshing state... [id=7033781:wuan]
data.github_user.meejah: Read complete after 2s [id=145599]
data.github_user.jean_paul: Read complete after 2s [id=254565]
module.team_foo.github_team_membership.team_membership["exarkun"]: Refreshing state... [id=6696818:exarkun]
module.team_foo.github_team_membership.team_membership["crwood"]: Refreshing state... [id=6696818:crwood]
module.team_internal.github_team_membership.team_membership["btlogy"]: Refreshing state... [id=6696813:btlogy]
module.team_internal.github_team_membership.team_membership["exarkun"]: Refreshing state... [id=6696813:exarkun]
module.team_test.github_team_membership.team_membership["wuan"]: Refreshing state... [id=6696811:wuan]
module.team_internal.github_team_membership.team_membership["meejah"]: Refreshing state... [id=6696813:meejah]
module.team_internal.github_team_membership.team_membership["wuan"]: Refreshing state... [id=6696813:wuan]
module.team_project.github_team_membership.team_membership["exarkun"]: Refreshing state... [id=6696757:exarkun]
module.team_project.github_team_membership.team_membership["wuan"]: Refreshing state... [id=6696757:wuan]
module.team_test.github_team_membership.team_membership["c-chroniko"]: Refreshing state... [id=6696811:c-chroniko]
module.team_test.github_team_membership.team_membership["exarkun"]: Refreshing state... [id=6696811:exarkun]
module.team_test.github_team_membership.team_membership["meejah"]: Refreshing state... [id=6696811:meejah]
module.repo1.github_branch_protection_v3.branch_protection[0]: Refreshing state... [id=test-repo-1:main]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.repo-sbx-actions.github_actions_secret.repository_secret["CID_PRIVATE_KEY"] must be replaced
-/+ resource "github_actions_secret" "repository_secret" {
      ~ created_at      = "2022-11-24 14:30:55 +0000 UTC" -> (known after apply)
      ~ id              = "sbx-actions:CID_PRIVATE_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2022-11-24 14:30:55 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @btlogy, Action: `pull_request`, Working Directory: ``, Workflow: `GitHub config CI`*